In [32]:
import pandas as pd
import numpy as np

In [35]:
#.duplicated() identifies duplicate rows
#-specify subset=column(s) to look for duplicates across a subset of columns

In [36]:
#subset='product' will only look for duplicates in that column
#in this case rows 2 and 3 are duplicates of the first row("Dairy")
#keep="last" will keep the final duplicate row, drop the rest
#ignore_index=True will reset the index so there are no gaps

In [42]:
oil = pd.read_csv("../retail/oil.csv")

oil.columns = ['date', 'price']

oil['euro_price'] = oil['price'] * 1.1

oil = oil.append(oil.iloc[-1]).reset_index(drop=True)

oil.tail()

C:\Users\BERK\AppData\Local\Temp\ipykernel_20260\1239599299.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  oil = oil.append(oil.iloc[-1]).reset_index(drop=True)

            date  price  euro_price
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1217  2017-08-31  47.26      51.986
1218  2017-08-31  47.26      51.986

In [38]:
oil.shape

(1219, 3)

In [39]:
oil.nunique(dropna=False)

date          1218
price          999
euro_price     999
dtype: int64

In [40]:
oil.duplicated(subset='price').sum()

220

In [43]:
oil.drop_duplicates(subset=['price'], ignore_index=True)

           date  price  euro_price
0    2013-01-01    NaN         NaN
1    2013-01-02  93.14     102.454
2    2013-01-03  92.97     102.267
3    2013-01-04  93.12     102.432
4    2013-01-07  93.20     102.520
..          ...    ...         ...
994  2017-08-15  47.57      52.327
995  2017-08-18  48.59      53.449
996  2017-08-21  47.39      52.129
997  2017-08-30  45.96      50.556
998  2017-08-31  47.26      51.986

[999 rows x 3 columns]